# Ficha de trabalho 1
1 - Considera o ficheiro **notas.csv** com a classificação de algumas disciplinas do curso de bioinformática.
Importa os dados para um objeto do tipo pandas.DataFrame

In [98]:
import pandas as pd

notas = pd.read_csv("notas.csv")

2 - Ordena a informação pela ordem alfabética dos nomes.

In [8]:
notas.sort_values("Nome")

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
5   Carina          19.0             18.0                20.0
1    Carla          17.0             16.0                 NaN
7  Joaquim           NaN             15.0                12.0
4     José          14.0             17.0                12.0
0     João          12.0             16.0                17.0
3    Pedro          16.0              NaN                18.0
8  Ricardo          15.0             15.0                14.0
2    Sónia           NaN             18.0                18.0
6    Telma          16.0             14.0                12.0
9    Vanda          16.0             15.0                18.0

3 - Calcula a média de cada uma das disciplinas.

In [11]:
notas["Laboratórios"].mean()

15.625

In [19]:
notas.mean()

Laboratórios          15.625000
 Alg. Avançados       16.000000
 Biologia Sistemas    15.666667
dtype: float64

4 - Seleciona o nome dos alunos com classificação igual ou superior 16 na disciplina de Laboratórios.

In [59]:
notas[notas.iloc[:,1] >= 16].iloc[:,0:2]

     Nome  Laboratórios
1   Carla          17.0
3   Pedro          16.0
5  Carina          19.0
6   Telma          16.0
9   Vanda          16.0

In [60]:
notas.loc[notas.Laboratórios >= 16, ['Nome', 'Laboratórios']]

     Nome  Laboratórios
1   Carla          17.0
3   Pedro          16.0
5  Carina          19.0
6   Telma          16.0
9   Vanda          16.0

5 - Cria uma nova coluna com a média de cada um dos alunos nas 3 disciplinas.

In [49]:
notas["Média"] = notas.mean(axis=1)

In [50]:
notas

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas      Média
0     João          12.0             16.0                17.0  15.000000
1    Carla          17.0             16.0                 NaN  16.500000
2    Sónia           NaN             18.0                18.0  18.000000
3    Pedro          16.0              NaN                18.0  17.000000
4     José          14.0             17.0                12.0  14.333333
5   Carina          19.0             18.0                20.0  19.000000
6    Telma          16.0             14.0                12.0  14.000000
7  Joaquim           NaN             15.0                12.0  13.500000
8  Ricardo          15.0             15.0                14.0  14.666667
9    Vanda          16.0             15.0                18.0  16.333333

6 - Considera a seguinte informação adicional.
```python
Sexo = ['M','F','F','M','M','F','F','M','M','F']
Idade = [23,21,25,21,22,23,21,20,27,21]
```
Constroi um novo DataFrame (df2) com a informação adicional dos alunos.

In [99]:
sexo = ['M','F','F','M','M','F','F','M','M','F']
idade = [23,21,25,21,22,23,21,20,27,21]

df2 = pd.DataFrame({"Sexo": sexo, "Idade": idade})
df2

  Sexo  Idade
0    M     23
1    F     21
2    F     25
3    M     21
4    M     22
5    F     23
6    F     21
7    M     20
8    M     27
9    F     21

7 - Compila a informação presente nos dois DataFrames (df e df2) num único DataFrame.

In [104]:
notas = notas.join(df2)

In [85]:
notas["Sexo"] = sexo
notas["Idade"] = idade

notas

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas Sexo  Idade
0     João          12.0             16.0                17.0    M     23
1    Carla          17.0             16.0                 NaN    F     21
2    Sónia           NaN             18.0                18.0    F     25
3    Pedro          16.0              NaN                18.0    M     21
4     José          14.0             17.0                12.0    M     22
5   Carina          19.0             18.0                20.0    F     23
6    Telma          16.0             14.0                12.0    F     21
7  Joaquim           NaN             15.0                12.0    M     20
8  Ricardo          15.0             15.0                14.0    M     27
9    Vanda          16.0             15.0                18.0    F     21

8 - A média da notas das raparigas é mais alta, em comparação com a dos rapazes, na disciplina de Biologia Sistemas?

In [127]:
notas.loc[notas.Sexo == 'M'].iloc[:,3].mean()

14.6

In [114]:
notas.loc[notas.Sexo == 'F'].iloc[:,3].mean()

17.0

9 - Remove do DataFrame os alunos que têm disciplinas em atraso. Coloca o resultado em df3. Os alunos com disciplinas em atraso têm valor omisso nessa coluna.

10 - Cria uma tabela pivot que apresente a média das notas de Laboratórios agrupada por idades para ambos os sexos.

11 - Adiciona uma nova coluna que indique se o aluno tem bolsa de Mérito ou não. Para ter bolsa de Mérito o aluno não pode ter disciplinas em atraso e média tem que ser superior a 17 valores. Explora a função **apply**.